#ifndef _JHTETRIS_EXT_C_
#define _JHTETRIS_EXT_C_

//--------------------------------------------------------------------------------------//


#define BRICK_SYMBOL	'#'
#define BLOCK_COUNT		24

class JHTetrisExt : public JHTetris
{
public:
	JHTetrisExt();
	virtual ~JHTetrisExt();

public:
	void OnGameStartAct();				//	게임 시작 시점에 처리할 액션 (상속)
	void OnGameOverAct();				//	게임 오버 시점에 처리할 액션 (상속)
	void OnBlockCopyN2CAct();			//	다음 블록을 현재 블록으로 바꾸는 시점에 처리 될 액션 (상속)
	void OnLineCompleteAct(int nLine);	//	라인이 완성되는 시점에 처리할 액션 (상속)
	void OnBlockDownAct();				//	블록이 내려 가는 시점에서 처리할 액션 (상속) 
	void OnBlockTurnAct();				//	블록을 회전하는 시점에 처리할 액션 (상속)
	void OnBlockMoveAct();				//	블록을 움직이는 시점에 처리할 액션 (상속)	
	void OnImpossibleAct();				//	불가능한 움직임을 시도할 때 나타내는 액션 (상속)
	void OnSettleAct();					//	블록을 바닥에 고정 하는 시점에 처리할 액션 (상속)

public:
	int	m_nBlockCount;					//	일정 갯수의 블록이 맞추어 질 때마다 하강 속도 증가
};


//--------------------------------------------------------------------------------------//

//=====================================================================================//
//	생성자
//
//
//=====================================================================================//
JHTetrisExt::JHTetrisExt()
{
	m_nBlockCount = 0;
}

//=====================================================================================//
//	소멸자
//
//
//=====================================================================================//
JHTetrisExt::~JHTetrisExt()
{

}

/////////////////=======================================================/////////////////
/////////																		/////////
/////////						VIRTUAL MEMBERS									/////////
/////////																		/////////
/////////////////=======================================================/////////////////

//=====================================================================================//
//	게임 시작 - 게임 시작시 발생할 액션을 명시 한다.
//
//
//=====================================================================================//
void JHTetrisExt::OnGameStartAct()
{

}

//=====================================================================================//
//	게임 오버 - 게임 종료시 발생할 액션을 명시한다.
//
//
//=====================================================================================//
void JHTetrisExt::OnGameOverAct()
{

}

//=====================================================================================//
//	블록 변환 - 다음 블록을 불러 오는 시점의 액션을 명시한다.
//
//
//=====================================================================================//
void JHTetrisExt::OnBlockCopyN2CAct()
{

}

//=====================================================================================//
//	라인 완성 - 라인이 완성 되었을 때 발생할 액션을 명시 한다.
//	
//
//=====================================================================================//
void JHTetrisExt::OnLineCompleteAct(int nLine)
{
	if (m_nBlockCount < BLOCK_COUNT)
	{
		m_nBlockCount++;
	}
	else
	{
		if (m_nMovePoint > 0)
		{
			m_nMovePoint--;
		}

		m_nBlockCount = 0;
	}
}

//=====================================================================================//
//	블록 하강 - 블록이 한 칸 아래로 내려 갈 때 발생할 액션을 명시 한다.
//	
//
//=====================================================================================//
void JHTetrisExt::OnBlockDownAct()
{

}

//=====================================================================================//
//	블록 회전 - 블록을 회전 시킬 때 발생할 액션을 명시 한다.
//	
//
//=====================================================================================//
void JHTetrisExt::OnBlockTurnAct()
{

}

//=====================================================================================//
//	블록 이동 - 블록을 이동 시킬 때 발생할 액션을 명시 한다.
//	
//
//=====================================================================================//
void JHTetrisExt::OnBlockMoveAct()
{

}

//=====================================================================================//
//	블가능한 액션 - 장애물이 있는 곳으로의 이동 시도 또는  회전할 수 없는 곳에서의 회전
//	시도등의 불가능한 액션 시도시의 액션 명시을 명시한다.
//
//=====================================================================================//
void JHTetrisExt::OnImpossibleAct()
{

}

//=====================================================================================//
//	블록 고정 - 블록을 바닥에 고정 시킬 때 발생할 액션을 명시 한다.
//	
//
//=====================================================================================//
void JHTetrisExt::OnSettleAct()
{

}

//--------------------------------------------------------------------------------------//

#endif
